app/controllers/all_products_controller.rb

  def all
  	@prod= Product.where(category: "Obraz")
---
SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Obraz"]]