app/controllers/books_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Ksiazki"]]
---
	def all
  	@prod= Product.where(category: "Ksiazki")