app/controllers/books_en_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Ksiazki"]]
---
  def index
  		@prod= Product.where(category: "Ksiazki")