app/controllers/electronics_en_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Elektronika"]]
---
  def index
  	@prod= Product.where(category: "Elektronika")