app/controllers/elektronika_controller.rb

	def index
  	@prod= Product.where(category: "Elektronika")
---
SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Elektronika"]]