app/controllers/koszyk_controller.rb

	def index
		@product= Product.where(:check => true).all
---
SELECT "products".* FROM "products" WHERE "products"."check" = ?  [["check", "true"]]