app/controllers/meble_en_controller.rb

  def index
  		@prod= Product.where(category: "Meble")
---
SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Meble"]]