app/controllers/meble_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Meble"]]
---
  def index
  	@prod= Product.where(category: "Meble")