app/controllers/paintings_en_controller.rb

  def index
  	@prod= Product.where(category: "Paintings")
---
SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Paintings"]]