app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "products" SET "check" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["check", "t"], ["updated_at", "2015-08-24 11:17:17.983088"], ["id", 12]]
---
  def add
    @product = Product.find(params[:id])
    @product.update_attribute(:check, "true")

INSERT INTO "products" ("title", "category", "description", "price", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "qazqaz"], ["category", "qaz"], ["description", "qaz"], ["price", 22.0], ["avatar", nil], ["created_at", "2015-08-20 13:38:12.402017"], ["updated_at", "2015-08-20 13:38:12.402017"]]
---
  def create
    @product = Product.new(product_params)
    @product.avatar = params[:file]



    respond_to do |format|
      if @product.save

UPDATE "products" SET "price" = ?, "price2" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 400.0], ["price2", 399.99], ["updated_at", "2015-08-21 08:35:40.611315"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)