app/controllers/ubrania_controller.rb

  def index
  	@prod= Product.where(category: "Ubrania")
---
SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Ubrania"]]